In [1]:
import pandas as pd

In [2]:
#Lista
data = [['Juan', 25], ['Maria', 30], ['Pedro', 40]]
print(type(data))

<class 'list'>

In [3]:
df = pd.DataFrame(data, columns=['Nombre', 'Edad'])
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [4]:
#Diccionario
data = {'Nombre': ['Juan', 'Maria', 'Pedro'],
        'Edad': [25, 30, 40]}
print(type(data))

<class 'dict'>

In [5]:
df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [6]:
#Lista de tuplas
data = [('Juan', 25), ('Maria', 30), ('Pedro', 40)]
print(type(data))

<class 'list'>

In [7]:
df = pd.DataFrame(data, columns=['Nombre', 'Edad'])
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [8]:
# Crear un df a partir de un archivo

In [9]:
df = pd.read_csv('../data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [10]:
df = pd.read_csv('../data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [11]:
df = pd.read_csv('../data/data_without_header', header = None, names = ['Nombre','Edad','Ciudad'])
df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
df = pd.read_json('../data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [13]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [14]:
df.head(1)

  nombre  edad  ciudad
0   Juan    25  Madrid

In [15]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [16]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [17]:
df.shape

(3, 3)

In [18]:
df['nombre'] #Obtener valores de la columna nombre

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [19]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [20]:
df.loc[0] #Obtiene el primer registro

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [21]:
df.loc[[0, 2]] #Obtener mas de una registro

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [22]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [23]:
data = {
    'grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
    'valor': [10, 15, 25, 12, 27, 33]
}
df = pd.DataFrame(data)
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [24]:
df.groupby('grupo').mean()

           valor
grupo
A      20.666667
B      20.000000

In [25]:
df.groupby('grupo').sum()

       valor
grupo
A         62
B         60

In [26]:
import numpy as np

In [27]:
# data = {
#     'A': [1,2,None,4],
#     'B': [4,None,5,7]
# }
data = {
    'A': [1,2,np.nan,4], #np.nan indica que no tiene valor, que es nulo, que no es un entero. None tambien pero es mas generico
    'B': [4,np.nan,5,7]
}

df = pd.DataFrame(data)
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [28]:
df_lleno = df.fillna(value=0)
df_lleno

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  5.0
3  4.0  7.0

In [29]:
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [30]:
df_sin_na = df.dropna()
df_sin_na

     A    B
0  1.0  4.0
3  4.0  7.0

In [31]:
def suma(a,b) :
    return a +b

In [32]:
df['sumaAB'] = df['A'] + df['B']
df

     A    B  sumaAB
0  1.0  4.0     5.0
1  2.0  NaN     NaN
2  NaN  5.0     NaN
3  4.0  7.0    11.0

In [33]:
df['suma'] = df.apply( lambda row :  suma(row['A'], row['B']), axis=1)
df

     A    B  sumaAB  suma
0  1.0  4.0     5.0   5.0
1  2.0  NaN     NaN   NaN
2  NaN  5.0     NaN   NaN
3  4.0  7.0    11.0  11.0

In [34]:
def doble(x):
    return x*2

In [35]:
df['dobleB'] = df['B'].apply(doble)
df

     A    B  sumaAB  suma  dobleB
0  1.0  4.0     5.0   5.0     8.0
1  2.0  NaN     NaN   NaN     NaN
2  NaN  5.0     NaN   NaN    10.0
3  4.0  7.0    11.0  11.0    14.0

In [36]:
df['dobleA'] = df['A'].apply(doble)
df

     A    B  sumaAB  suma  dobleB  dobleA
0  1.0  4.0     5.0   5.0     8.0     2.0
1  2.0  NaN     NaN   NaN     NaN     4.0
2  NaN  5.0     NaN   NaN    10.0     NaN
3  4.0  7.0    11.0  11.0    14.0     8.0

In [37]:
df['suma2'] = df.apply(lambda row: row['A'] + row['B'], axis=1)
df

     A    B  sumaAB  suma  dobleB  dobleA  suma2
0  1.0  4.0     5.0   5.0     8.0     2.0    5.0
1  2.0  NaN     NaN   NaN     NaN     4.0    NaN
2  NaN  5.0     NaN   NaN    10.0     NaN    NaN
3  4.0  7.0    11.0  11.0    14.0     8.0   11.0